<br><br>
<b><font size=100>PANDAS</font></b>
<br>
<br>
By अंkur गोswami
____

In [28]:
import numpy as np
import pandas as pd

# Series:
____
Series are 1-Dimensional pandas data structure.

## Creating Series:
Series can be created using **``pandas.Series()``** function. The function mainly takes two arguments Data & Index.

In [29]:
pd.Series(data=[10,20,30])

0    10
1    20
2    30
dtype: int64

In [30]:
pd.Series(data=[10,20,30],index=['a','b','c'])

a    10
b    20
c    30
dtype: int64

#### Using Dictionary:

In [31]:
pd.Series({'a':10,'b':20,'c':30})

a    10
b    20
c    30
dtype: int64

## Accessing elements:

In [32]:
Series=pd.Series(data=[10,20,30],index=['a','b','c'])

### Bracket method:

In [33]:
Series['b']

20

### Dot method:

In [34]:
Series.b

20

### loc/iloc method:

In [35]:
Series.loc['b']

20

In [36]:
Series.iloc[1]

20

<b>Note:</b> Try avoiding **``Dot method``** as the index might be of same name as of a method in pandas.

## Mathematical Operations on Series:
Mathematical Operations on Series is same as mathematical operations on NumPy. <a href='NumPy.ipynb#Mathematical_operations'>Click Here</a> to jump to Mathematical Operations section of NumPy.
____

# DataFrames:
____
DataFrames are 2-Dimensional pandas data structure.

## Creating DataFrames:
DataFrames can be created using **``pandas.DataFrame()``** function. The function mainly takes three arguments Data, Index & Column.

In [37]:
pd.DataFrame(np.random.randn(5,4))

          0         1         2         3
0 -1.410636  0.252301 -0.475485  1.850371
1  0.945186  0.066637 -1.276462 -0.225121
2  0.360388  0.055430 -0.018556 -0.536016
3  0.358171 -0.042977 -0.020517  0.032014
4 -1.430013  0.780550 -0.662381  0.121521

In [38]:
a=pd.DataFrame(data=np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

#### Using Dictionary:
The innermost dictionary represents a column.

In [39]:
pd.DataFrame({'W':{'A':1,'B':2,'C':3},'X':{'A':4,'B':5,'C':6},'Y':{'A':7,'B':8,'C':9}})

   W  X  Y
A  1  4  7
B  2  5  8
C  3  6  9

Note: We can also use list/tuple in place of internal dictionary.

**`.info()`** method is used to return details of the dataframe.

In [40]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
W    5 non-null float64
X    5 non-null float64
Y    5 non-null float64
Z    5 non-null float64
dtypes: float64(4)
memory usage: 200.0+ bytes

## Accessing elements:

In [41]:
Dataframe=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

### Accessing Columns:

#### Bracket method:

In [42]:
Dataframe['W']

A    1.601213
B   -0.195837
C    1.255132
D   -0.566326
E   -0.013225
Name: W, dtype: float64

#### Dot method:

In [43]:
Dataframe.W

A    1.601213
B   -0.195837
C    1.255132
D   -0.566326
E   -0.013225
Name: W, dtype: float64

NOTE: Try avoiding **``Dot method``** as the index might be of same name as of a method in pandas.

### Accessing Rows:

In [44]:
Dataframe.loc['A']

W    1.601213
X    0.011736
Y   -0.927360
Z   -0.725712
Name: A, dtype: float64

<b>Note:</b> A better way to access rows is by using **`iloc`**

In [45]:
Dataframe.iloc[1:3]

          W         X         Y         Z
B -0.195837  0.300939  0.449823  0.946719
C  1.255132  0.843403 -0.755066 -1.028409

### Accessing Individual Elements:

#### Single Bracket method:

In [46]:
Dataframe.loc['C','X']

0.8434033564274781

In [47]:
Dataframe.iloc[2:4,1:]

          X         Y         Z
C  0.843403 -0.755066 -1.028409
D  0.192033 -0.985599  0.657336

#### Double Bracket method:

In [48]:
Dataframe.loc['C']['X']

0.8434033564274781

In [49]:
Dataframe['X']['C']

0.8434033564274781

### Fancy Indexing:

In [50]:
Dataframe[['X','W']]

          X         W
A  0.011736  1.601213
B  0.300939 -0.195837
C  0.843403  1.255132
D  0.192033 -0.566326
E  1.003907 -0.013225

In [51]:
Dataframe.loc[['C','A']]

          W         X         Y         Z
C  1.255132  0.843403 -0.755066 -1.028409
A  1.601213  0.011736 -0.927360 -0.725712

## Inserting Columns:
**``.insert()``** method of the dataframe is used to insert new columns. The function takes mainly three arguments location, column and value. **``location``** is index before which column is to be added and is an integer value. **``column``** is column name & **``value``** is entries in the column.

In [52]:
Dataframe.insert(2,'K',[10,20,30,40,50])
Dataframe

          W         X   K         Y         Z
A  1.601213  0.011736  10 -0.927360 -0.725712
B -0.195837  0.300939  20  0.449823  0.946719
C  1.255132  0.843403  30 -0.755066 -1.028409
D -0.566326  0.192033  40 -0.985599  0.657336
E -0.013225  1.003907  50 -0.297577  0.792170

## Deleting Columns/Rows:
**``.drop()``** method of the dataframe is used to delete columns/rows. The function takes mainly three arguments column/row, axis and inplace value. **``column/row``** is name of column/row is to be deleted. **``axis``** defines whether it is a column or a row. For row, axis=0 and for column, axis=1 & **``inplace``** value determines whether the changes will be reflected in original dataframe or not.

In [53]:
Dataframe.drop('K',axis=1,inplace=True)
Dataframe

          W         X         Y         Z
A  1.601213  0.011736 -0.927360 -0.725712
B -0.195837  0.300939  0.449823  0.946719
C  1.255132  0.843403 -0.755066 -1.028409
D -0.566326  0.192033 -0.985599  0.657336
E -0.013225  1.003907 -0.297577  0.792170

In [54]:
Dataframe.drop('C',axis=0,inplace=False)

          W         X         Y         Z
A  1.601213  0.011736 -0.927360 -0.725712
B -0.195837  0.300939  0.449823  0.946719
D -0.566326  0.192033 -0.985599  0.657336
E -0.013225  1.003907 -0.297577  0.792170

In [55]:
Dataframe

          W         X         Y         Z
A  1.601213  0.011736 -0.927360 -0.725712
B -0.195837  0.300939  0.449823  0.946719
C  1.255132  0.843403 -0.755066 -1.028409
D -0.566326  0.192033 -0.985599  0.657336
E -0.013225  1.003907 -0.297577  0.792170

## Mathematical Operations on DataFrames:
Mathematical Operations on DataFrames is same as mathematical operations on NumPy. <a href='NumPy.ipynb#Mathematical_operations'>Click Here</a> to jump to Mathematical Operations section of NumPy.

## Resetting Index:
**`.reset_index()`** method resets indices to conventional indices 0,1,2,3,...

In [56]:
Dataframe.reset_index(inplace=True)

In [57]:
Dataframe

  index         W         X         Y         Z
0     A  1.601213  0.011736 -0.927360 -0.725712
1     B -0.195837  0.300939  0.449823  0.946719
2     C  1.255132  0.843403 -0.755066 -1.028409
3     D -0.566326  0.192033 -0.985599  0.657336
4     E -0.013225  1.003907 -0.297577  0.792170

## Setting Index:
**`.set_index()`** method sets a particular column **`keys`** to indices.

In [58]:
Dataframe.set_index('index',inplace=True)

In [59]:
Dataframe

              W         X         Y         Z
index
A      1.601213  0.011736 -0.927360 -0.725712
B     -0.195837  0.300939  0.449823  0.946719
C      1.255132  0.843403 -0.755066 -1.028409
D     -0.566326  0.192033 -0.985599  0.657336
E     -0.013225  1.003907 -0.297577  0.792170

## Converting Categories to Dummies(One-Hot Encoding):
**`pd.get_dummies()`** function is used to convert categorical data into dummy variables. It deals with Dummy Variable Trap.

In [60]:
df=pd.DataFrame(['Male','Female','Male','Male','Female'],columns=['Sex'])
df

      Sex
0    Male
1  Female
2    Male
3    Male
4  Female

In [61]:
pd.get_dummies(df['Sex'])

   Female  Male
0       0     1
1       1     0
2       0     1
3       0     1
4       1     0

## Multi-level Indexing:

In [62]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))

In [63]:
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [64]:
Multidf=pd.DataFrame(data=np.random.randn(6,3),index=hier_index,columns=['A','B','C'])
Multidf

             A         B         C
G1 1 -1.843676 -0.435844  0.876747
   2  1.843235 -1.293501  1.379391
   3  1.359088 -0.011714 -0.432283
G2 1  0.028689  0.905934  1.916621
   2 -0.468541 -0.570576 -0.084234
   3 -1.243160  0.398115 -0.789132

### Accessing elements:

In [65]:
Multidf.loc['G1'].loc[3]

A    1.359088
B   -0.011714
C   -0.432283
Name: 3, dtype: float64

In [66]:
Multidf['A']

G1  1   -1.843676
    2    1.843235
    3    1.359088
G2  1    0.028689
    2   -0.468541
    3   -1.243160
Name: A, dtype: float64

### Setting index/column names:

In [67]:
Multidf.index.names=['Groups','Num']
Multidf

                   A         B         C
Groups Num
G1     1   -1.843676 -0.435844  0.876747
       2    1.843235 -1.293501  1.379391
       3    1.359088 -0.011714 -0.432283
G2     1    0.028689  0.905934  1.916621
       2   -0.468541 -0.570576 -0.084234
       3   -1.243160  0.398115 -0.789132

In [68]:
Multidf.columns.names=['Letters']
Multidf

Letters            A         B         C
Groups Num
G1     1   -1.843676 -0.435844  0.876747
       2    1.843235 -1.293501  1.379391
       3    1.359088 -0.011714 -0.432283
G2     1    0.028689  0.905934  1.916621
       2   -0.468541 -0.570576 -0.084234
       3   -1.243160  0.398115 -0.789132

### Cross-Section:

In [69]:
Multidf.xs(2,level='Num')

Letters         A         B         C
Groups
G1       1.843235 -1.293501  1.379391
G2      -0.468541 -0.570576 -0.084234

## Handing missing Data:

In [70]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [71]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Dropna method:
**`.dropna()`** method mainly takes three arguments, axis, thresh and inplace. This method returns series along **`axis`** provided having atleast **`thresh`** number of non-nan values.

In [72]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [73]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [74]:
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

### Fillna method:
**`.fillna()`** mainly takes three arguments, value, axis and inplace. This method replaces nan values along **`axis`** provided with **`value`** given.

In [75]:
df.fillna(value="FILLED",axis=1)

        A       B  C
0       1       5  1
1       2  FILLED  2
2  FILLED  FILLED  3

In [76]:
for i in range(3):
    df.iloc[:,i].fillna(np.mean(df.iloc[:,i]),inplace=True)
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

## Groupby:
The groupby method allows you to group rows of data together and call aggregate functions

In [77]:
dframe=pd.DataFrame(data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
                            'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
                            'Sales':[200,120,340,124,243,350]})
dframe

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [78]:
grp_dframe=dframe.groupby('Company')

### Operations on groups:

**`.describe()`** method returns every information of every group like count, mean, standard deviation, minimum, maximum,etc.

In [79]:
grp_dframe.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

**`.sum()`** method returns sum of values of each group.

In [80]:
grp_dframe.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

**`.max()`** method returns maximum value in each group.

In [81]:
grp_dframe.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

## Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating.

### Concatenation:
Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together.

In [82]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [83]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [84]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [85]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [86]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [87]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging:

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together.

In [88]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [89]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [90]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [91]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Or to show a more complicated example:

In [92]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [93]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [94]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [95]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [96]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [97]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [98]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### Joining:
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [99]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [100]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [101]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [102]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [103]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Other Operations:

In [104]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Unique Values:

**`.unique()`** method returns unique values in a series.

In [105]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

**`.nunique()`** method returns number of unique values in a series.

In [106]:
df['col2'].nunique()

3

**`.value_count()`** method counts for each value in a series.

In [107]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Sorting:

In [108]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi